Revit 2027 API
Truss.TrussType Property
Retrieve/set an object that represents the type of the truss.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TrussType TrussType { get; set; }
Public Property TrussType As TrussType
	Get
	Set
public:
property TrussType^ TrussType {
	TrussType^ get ();
	void set (TrussType^ value);
}
member TrussType : TrussType with get, set
Property Value
TrussType
See Also
Reference
Truss Class
Autodesk.Revit.DB.Structure Namespace